Revit 2027 API
ParameterFilterRuleFactory.CreateGreaterOrEqualRule(ElementId, String) Method
 Creates a filter rule that determines whether strings from the document are greater than or equal to a certain value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateGreaterOrEqualRule(
	ElementId parameter,
	string value
)
Public Shared Function CreateGreaterOrEqualRule (
	parameter As ElementId,
	value As String
) As FilterRule
public:
static FilterRule^ CreateGreaterOrEqualRule(
	ElementId^ parameter,
	String^ value
)
static member CreateGreaterOrEqualRule :
        parameter : ElementId *
        value : string -> FilterRule
Parameters
parameter ElementId
 A string-typed parameter used to get values from the document for a given element.
value String
 The user-supplied string value against which values from the document will be compared.
Return Value
FilterRule
 Created filter rule object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 For strings, a value is "greater" than another if it would appear after the other in an alphabetically-sorted list.
See Also
Reference
ParameterFilterRuleFactory Class
CreateGreaterOrEqualRule Overload
Autodesk.Revit.DB Namespace